# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

m = int(input('Введите месяц цифрой: '))
if m [3:5]:
    print('весна')
    elif m [6:8]:
    print('лето')
    elif m [9-11]:
    print('осень')
    else
    print('зима')


