# Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

salary_per_week = lambda job_time, rate, bonus: (job_time * rate) + bonus
print(salary_per_week(30, 20, 50))